
(package! org-roam-server)

(package! org-journal)
(package! org-kanban
  :recipe (:host github :repo "gizmomogwai/org-kanban"))
(package! org-pdftools
  :recipe (:host github :repo "fuxialexander/org-pdftools"))
(package! org-ref
  :recipe (:host github :repo "jkitchin/org-ref"))
(package! org-noter
  :recipe (:host github :repo "weirdNox/org-noter"))
(package! org-noter-pdftools
  :recipe (:host github :repo "fuxialexander/org-pdftools"))
(package! emacs-application-framework
  :recipe (:host github :repo "manateelazycat/emacs-application-framework"
           :files ("eaf.el" "src/lisp/*.el")))
(package! ctable :recipe (:host github :repo "kiwanami/emacs-ctable"))
(package! deferred :recipe (:host github :repo "kiwanami/emacs-deferred"))
(package! epc :recipe (:host github :repo "kiwanami/emacs-epc"))
(package! org-bullets)
(package! codeium :recipe (:host github :repo "Exafunction/codeium.el"))
(package! helm)
(package! ggtags)
(package! helm-gtags)
(package! org-auto-tangle)
(package! emojify)
(package! beacon)
(package! flycheck-aspell)
(package! flycheck-languagetool)
(package! ivy-posframe)
(package! fzf)
(package! forge)
(package! magit)
(package! sqlite3)
(package! dired-preview)
(package! peep-dired)
(package! languagetool)
(package! impatient-mode)
(package! org-superstar)
(package! org-super-agenda)
(package! plantuml-mode)
(package! org-fancy-priorities)
(package! org-dashboard)
(package! org-appear)
(package! org-pretty-tags)
(package! ivy-emoji)
(package! chatgpt-shell)
(package! dall-e-shell)
(package! org-ai)
(package! py-autopep8)
